app/serializers/user_serializer.rb

  def articles
    # object.articles.map do |article|
    # {
    #   id: article.id
    # }
    # end
    object.articles.map{|ar| ar.id}
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 16]]