application_folder/app/controllers/articles_controller.rb

  def index

    @articles = Article.all.where(published: true)
    @articles = @articles.where('title ilike ?', "%#{params[:title]}%" ) if params[:title].present?
    @articles = @articles.where('topic ilike ?', "%#{params[:topic]}%" ) if params[:topic].present?
    @articles = @articles.where('text ilike ?', "%#{params[:text]}%" ) if params[:text].present?

    @articles = @articles.where("created_at >= #{params[:start_date]}" ) if params[:start_date].present?
    @articles = @articles.where("created_at <= #{params[:end_date]}" ) if params[:end_date].present?

    @articles = @articles.where("likes >= #{params[:likes]}" ) if params[:likes].present?
    @articles = @articles.where("comments_cnt >= #{params[:comments_cnt]}" ) if params[:comments_cnt].present?
    @articles = @articles.where("views >= #{params[:views]}" ) if params[:views].present?

    @articles = @articles.where(user_id: params[:userid] ) if params[:userid].present?

    order = params.fetch('order',"desc")
    order = "desc" if order != "asc"
    order_by = params.fetch('order_by',"created_at")
    order_by = "created_at" if not ["created_at","likes","views"].include?(order_by)
    @articles = @articles.order("#{order_by} #{order.upcase}")

    @total = @articles.count()
    @total = [@total,1].max
    @page = params.fetch('pg',0).to_i
    @cntperpage = params.fetch('perpage',@total).to_i

    @articles = @articles.limit(@cntperpage).offset(@page*@cntperpage)
---
SELECT "articles".* FROM "articles" WHERE (title ilike '%sb%') AND (topic ilike '%n%') LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "articles".* FROM "articles" WHERE (title ilike '%sb%') AND (topic ilike '%a%') AND "articles"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 15], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."published" = $1  [["published", true]]
SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE (likes >= 2) AND (comments_cnt >= 4) AND "articles"."user_id" = $1  [["user_id", 16]]

  def show
    current_user.viewsleft += 1 if current_user.lastview < Date.today
    if @article.user_id == current_user.id
      current_user.viewhistory.push(@article.id.to_i)
      current_user.save

      render json: @article, status: :ok
    elsif current_user.viewsleft > 0
      #1 free view per day

      current_user.viewsleft -= 1
      current_user.save

      current_user.lastview = Date.today
      current_user.save

      current_user.viewhistory.push(@article.id.to_i)
      current_user.save

      @article.views += 1
      @article.save
---
INSERT INTO "articles" ("title", "topic", "text", "likes", "comments", "views", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "article new"], ["updated_at", "2023-08-03 17:19:26.659617"], ["id", 5]]
UPDATE "users" SET "updated_at" = $1, "viewsleft" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-05 05:29:26.219028"], ["viewsleft", 0], ["id", 16]]
UPDATE "articles" SET "views" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["views", 11], ["updated_at", "2023-08-05 05:29:26.239427"], ["id", 14]]
UPDATE "users" SET "updated_at" = $1, "viewhistory" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-05 07:49:11.467064"], ["viewhistory", "{14,11,14,11,10,13}"], ["id", 16]]
UPDATE "articles" SET "views" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["views", 20], ["updated_at", "2023-08-05 05:40:00.329586"], ["id", 14]]
UPDATE "users" SET "updated_at" = $1, "viewsleft" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-05 07:49:05.176526"], ["viewsleft", 4], ["id", 16]]
UPDATE "articles" SET "views" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["views", 1], ["updated_at", "2023-08-05 05:43:56.264262"], ["id", 10]]
INSERT INTO "articles" ("title", "topic", "text", "likes", "comments_cnt", "views", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "viewhistory" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-05 07:45:45.824241"], ["viewhistory", "{14}"], ["id", 16]]
UPDATE "articles" SET "views" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["views", 22], ["updated_at", "2023-08-05 07:45:45.828166"], ["id", 14]]
UPDATE "users" SET "updated_at" = $1, "viewhistory" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-05 07:49:05.181162"], ["viewhistory", "{14,11,14,11,10}"], ["id", 16]]
UPDATE "articles" SET "views" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["views", 6], ["updated_at", "2023-08-05 07:49:05.185491"], ["id", 10]]

  def myarticles
    @articles = current_user.articles.all.order(created_at: :desc)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 ORDER BY "articles"."created_at" DESC  [["user_id", 18]]

  def recomended
    liked = current_user.liked_articles
    if liked.empty?
      @articles = Article.all.where(published: true)
      @articles = @articles.where("user_id != #{current_user.id}").order(likes: :desc)
    else
      liked = liked.map{|id| Article.find(id).user_id}
      @articles = Article.all.where(published: true)
      @articles = @articles.where(user_id: liked).order(likes: :desc)
---
SELECT "articles".* FROM "articles"
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" IN ($1, $2) ORDER BY "articles"."likes" DESC  [["user_id", 16], ["user_id", 17]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."published" = $1  [["published", true]]
SELECT "articles".* FROM "articles" WHERE "articles"."published" = $1 AND "articles"."user_id" IN ($2, $3, $4) ORDER BY "articles"."likes" DESC  [["published", true], ["user_id", 17], ["user_id", 16], ["user_id", 16]]

  def topics
    topics = Article.all.where(published: true)
    topics = topics.map{|ar| ar.topic}
---
SELECT "articles".* FROM "articles" WHERE "articles"."published" = $1  [["published", true]]

  def toparticles
    articles = Article.all.where(published: true)
    articles = articles.map{|a| {id: a.id, value: a.likes.to_i+a.comments_cnt.to_i+a.views.to_i}}
    articles = articles.sort_by{|a| -1*a[:value]}
    articles = articles.map{|a| Article.find(a[:id])}
---
SELECT "articles".* FROM "articles" WHERE "articles"."published" = $1  [["published", true]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def viewhistory
    art_list = current_user.viewhistory
    art_list = art_list.map{|i| Article.find(i)}
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 17], ["id", 14], ["LIMIT", 1]]

  def create
    @article = current_user.articles.build(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "topic", "text", "likes", "comments_cnt", "views", "user_id", "created_at", "updated_at", "published") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def verify_user
      @articles = current_user.articles.find_by(id: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 16], ["LIMIT", 1]]