application_folder/app/controllers/payment_controller.rb

UPDATE "users" SET "updated_at" = $1, "viewsleft" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-05 07:17:35.649189"], ["viewsleft", 5], ["id", 18]]
---
      def webhook

        if params[:razorpay_signature].present?
          current_user.viewsleft += 5
          current_user.save