application_folder/app/controllers/user_controller.rb

  def index
    if user_signed_in?
      @users = User.where( "id != #{current_user.id}")
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def follow
    if current_user.id == @user.id
      render json: {message: "Bad parameters"}, status: :unprocessable_entity
    elsif current_user.followed_users.where(follower_id: current_user.id, followee_id: @user.id).count() != 0
      render json: {message: "Already following"}, status: :unprocessable_entity
    else
      FollowRelation.create_or_find_by(follower_id: current_user.id, followee_id: @user.id)
---
INSERT INTO "follow_relations" ("follower_id", "followee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 16], ["followee_id", 17], ["created_at", "2023-08-05 09:34:00.839010"], ["updated_at", "2023-08-05 09:34:00.839010"]]

  def add_liked_article
    if params[:id].present? and (not current_user.liked_articles.include? params[:id].to_i)
      current_user.liked_articles.push(params[:id])
      article = Article.find(params[:id])
      article.likes += 1

      if current_user.save
        article.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 16]]
UPDATE "users" SET "updated_at" = $1, "liked_articles" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-04 16:56:36.614034"], ["liked_articles", "{14}"], ["id", 18]]
UPDATE "articles" SET "likes" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["likes", 11], ["updated_at", "2023-08-04 16:56:36.619001"], ["id", 14]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "liked_articles" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-04 15:07:29.892934"], ["liked_articles", "{14}"], ["id", 16]]
UPDATE "articles" SET "likes" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["likes", 14], ["updated_at", "2023-08-05 09:45:08.762013"], ["id", 14]]

  def remove_liked_article
    if params[:id].present? and current_user.liked_articles.include? params[:id].to_i
      current_user.liked_articles.delete(params[:id].to_i)
      article = Article.find(params[:id])
      article.likes -= 1

      if current_user.save
        article.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 16]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "articles" SET "likes" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["likes", 13], ["updated_at", "2023-08-04 17:01:18.678154"], ["id", 14]]
UPDATE "users" SET "updated_at" = $1, "liked_articles" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-05 09:45:16.945645"], ["liked_articles", "{}"], ["id", 16]]
UPDATE "articles" SET "likes" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["likes", 13], ["updated_at", "2023-08-05 09:45:16.951092"], ["id", 14]]