application folder/app/serializers/user_serializer.rb

  def articles
    object.articles.map{|ar| ar.id}
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 16]]

  def lists
    object.lists.map{|l| l.id}
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 18]]