app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" IS NULL LIMIT $2  [["user_id", 17], ["LIMIT", 1]]
---
  def myarticles
    @articles = current_user.articles.all.order(created_at: :desc)
    @articles = @articles.map{ |article|

UPDATE "articles" SET "views" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["views", 11], ["updated_at", "2023-08-04 06:42:13.900702"], ["id", 14]]
---
  def update
    if @article.update(article_params)