app/controllers/articles_controller.rb

  def recomended
    liked = current_user.liked_articles
    if liked.empty?
      @articles = Article.where("user_id != #{current_user.id}").order(likes: :desc)
    else
      liked = liked.map{|id| Article.find(id).user_id}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def topics
    topics = Article.all
---
SELECT "articles"."topic" FROM "articles"

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "updated_at" = $1 WHERE "articles"."id" = $2  [["updated_at", "2023-08-05 07:30:13.428640"], ["id", 15]]

    def verify_user
      @articles = current_user.articles.find_by(id: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 17], ["id", 14], ["LIMIT", 1]]