app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 18]]
---
  def mylists
    render json: current_user.lists.all, each_serializer:ListSerializer, status: :ok

INSERT INTO "lists" ("name", "articles", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "2nd list"], ["articles", "{}"], ["user_id", 18], ["created_at", "2023-08-05 06:48:04.207244"], ["updated_at", "2023-08-05 06:48:04.207244"]]
---
  def create
    list = current_user.lists.build(list_params);
    if list.save

UPDATE "lists" SET "articles" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["articles", "{14}"], ["updated_at", "2023-08-05 06:45:37.177579"], ["id", 1]]
---
  def add
    @list.articles.push(params[:article_id].to_i)
    if @list.save

UPDATE "lists" SET "articles" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["articles", "{13,10}"], ["updated_at", "2023-08-05 06:46:01.704475"], ["id", 1]]
---
  def remove
    @list.articles.delete(params[:article_id].to_i)
    if @list.save

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]
---
  def deletelist
    @list.destroy

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 1], ["LIMIT", 1]]
---
  def set_list
    @list = current_user.lists.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 1], ["LIMIT", 1]]
---
  def verify_user
    list = current_user.lists.find_by(id: params[:id])