app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def index
    if user_signed_in?
      @users = User.where( "id != #{current_user.id}")
    else
      @users = User.all

INSERT INTO "follow_relations" ("follower_id", "followee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 17], ["followee_id", 16], ["created_at", "2023-08-04 10:17:49.553595"], ["updated_at", "2023-08-04 10:17:49.553595"]]
---
  def follow
    if current_user.id == @user.id
      render json: {message: "Bad parameters"}, status: :unprocessable_entity
    elsif current_user.followed_users.where(follower_id: current_user.id, followee_id: @user.id).count() != 0
      render json: {message: "Already following"}, status: :unprocessable_entity
    else
      FollowRelation.create_or_find_by(follower_id: current_user.id, followee_id: @user.id)

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 16]]
UPDATE "articles" SET "likes" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["likes", 11], ["updated_at", "2023-08-04 16:56:36.619001"], ["id", 14]]
UPDATE "users" SET "updated_at" = $1, "name" = $2, "liked_articles" = $3 WHERE "users"."id" = $4  [["updated_at", "2023-08-04 14:41:03.155586"], ["name", "sb"], ["liked_articles", "{}"], ["id", 16]]
UPDATE "users" SET "updated_at" = $1, "liked_articles" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-04 14:30:56.575955"], ["liked_articles", "{NULL}"], ["id", 16]]
---
  def add_liked_article
    current_user.liked_articles.push(params[:id]) if params[:id].present?
    if current_user.save

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 16]]
UPDATE "articles" SET "likes" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["likes", 11], ["updated_at", "2023-08-04 16:56:36.619001"], ["id", 14]]
UPDATE "users" SET "updated_at" = $1, "liked_articles" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-04 15:09:21.414130"], ["liked_articles", "{14}"], ["id", 16]]
---
  def remove_liked_article
    current_user.liked_articles.delete(params[:id].to_i) if params[:id].present?
    if current_user.save