app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def index
    if user_signed_in?
      @users = User.where( "id != #{current_user.id}")
    else
      @users = User.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def add_liked_article
    if params[:id].present? and (not current_user.liked_articles.include? params[:id].to_i)
      current_user.liked_articles.push(params[:id])
      article = Article.find(params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def remove_liked_article
    if params[:id].present? and current_user.liked_articles.include? params[:id].to_i
      current_user.liked_articles.delete(params[:id].to_i)
      article = Article.find(params[:id])